Repository: kinging123/riwp
Catalog: languages/riwp-*.po
Languages: he_il

# Post Type General Name
source: Memorials
he_il: הנצחות

# Post Type Singular Name
source: Memorial
he_il: הנצחה

source: Memorials
he_il: הנצחות

source: Memorial
he_il: הנצחה

source: Memorial Archives
he_il: ארכיוני הנצחות

source: Memorial Attributes
he_il: מאפייני הנצחות

source: Parent Memorial:
he_il: הנצחת אב:

source: All Memorials
he_il: כל ההנצחות

source: Add New Memorial
he_il: הוספת הנצחה חדשה

source: Add New
he_il: הוספת חדש

source: New Memorial
he_il: הנצחה חדשה

source: Edit Memorial
he_il: עריכת הנצחה

source: Update Memorial
he_il: עדכון הנצחה

source: View Memorial
he_il: צפייה בהנצחה

source: View Memorials
he_il: צפייה בהנצחות

source: Search Memorial
he_il: חיפוש הנצחות

source: Not found
he_il: לא נמצא

source: Not found in Trash
he_il: לא נמצא בפח האשפה

source: Person's Photo
he_il: תמונה של האדם

source: Set photo
he_il: הגדרת תמונה

source: Remove photo
he_il: הסר תמונה

source: Use as photo
he_il: קבע כתמונה

source: Insert into item
he_il: הוסף לפריט

source: Uploaded to this item
he_il: הועלה לפריט זה

source: Memorials list
he_il: רשימת הנצחות

source: Memorials list navigation
he_il: ניווט ברשימת הנצחות

source: Filter items list
he_il: סינון פריטי רשימה

source: R.I.P.
he_il: ז”ל

source: Hebrew Yahrzeit
he_il: יום שנה עברי

source: There was an error. More information:
he_il: ארעה שגיאה. עוד מידע:

source: Load More...
he_il: טען עוד שמות…

source: Search for memorials by name...
he_il: חפש נפטרים לפי שם…

source: Search
he_il: חיפוש

source: Soon-to-be Yahrzeit
he_il: יום שנה מתקרב

source: Recently Passed
he_il: נפטרו לאחרונה

source: By Name (Alphabetically)
he_il: לפי שם (א”ב)

source: Sort
he_il: מיון

source: Sorry, no memorials were found.
he_il: מצטערים, לא נמצאו הנצחות מתאימות.

source: Rest In WordPress (RIWP)
he_il: זכרונורדפרס לברכה (RIWP)

source: A perpetuation plugin, made on behalf of and for Barfeld.co.il.
he_il: תוסף הנצחה לאנשים שנפטרו, נעשה מטעם ברפלד (barfeld.co.il).

source: Reuven Karasik
he_il: ראובן קרסיק
